Project/app/controllers/activities_controller.rb

  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("customer_id", "description", "start_date", "end_date", "total_hours_of_work", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "customer_id" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["customer_id", 2], ["updated_at", "2017-11-14 16:23:22.091806"], ["id", 2]]