Project/app/controllers/bills_controller.rb

  def index
    @bills = Bill.all
---
SELECT "bills".* FROM "bills"

  def create
    @bill = Bill.new(bill_params)

    respond_to do |format|
      if @bill.save
---
INSERT INTO "bills" ("customer_id", "date_of_issue", "terms_of_payment", "hourly_rate", "tax_rate", "withholding", "discount", "paid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @bill.update(bill_params)
---
UPDATE "bills" SET "terms_of_payment" = ?, "discount" = ?, "updated_at" = ? WHERE "bills"."id" = ?  [["terms_of_payment", "30"], ["discount", 10], ["updated_at", "2017-11-14 16:20:05.877132"], ["id", 2]]

  def destroy
    @bill.destroy
---
DELETE FROM "bills" WHERE "bills"."id" = ?  [["id", 1]]

    def set_bill
      @bill = Bill.find(params[:id])
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]