Project/app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("name", "surname", "company", "phone_number", "address", "email", "vat_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "vat_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["vat_number", "01234567890"], ["updated_at", "2017-11-14 13:11:53.806457"], ["id", 1]]