app/views/bills/_form.html.erb

    <%= form.label :customer %>
    <%= form.select :customer_id, options_for_select(Customer.all.map{|c| [c, c.id]}), id: :activity_customer %>
---
SELECT "customers".* FROM "customers"