Project/app/views/activities/_form.html.erb

SELECT "customers".* FROM "customers"
---
      <%= form.label :customer %>
      <%= form.select :customer_id, options_for_select(Customer.all.map{|c| [c, c.id]}), id: :activity_customer %>